Repository: PALs-Software/DigitalAssistant
Catalog: Core/DigitalAssistant.Server/Modules/Setups/Setup.*.resx
Languages: de

source: Setup
de: Einrichtung

# Setup_Plural
source: Setup
de: Einrichtung

# AsrModel
source: Speech Recognition Model
de: Spracherkennungsmodel

# AsrLanguage
source: Speech Recognition Language
de: Spracherkennungssprache

# AsrMode
source: Mode
de: Modus

# AsrModelNotExistErr
source: The current selected speech recognition model does not exist in the huggingface repository https://huggingface.co/PALs-Software/DigitalAssistant.AsrModels. Please select another model configuration and try again.
de: Das aktuell ausgewählte Spracherkennungsmodell existiert nicht im huggingface Repository https://huggingface.co/PALs-Software/DigitalAssistant.AsrModels. Bitte wählen Sie eine andere Modellkonfiguration und versuchen Sie es erneut.

# AsrPrecision
source: Precision
de: Präzision

# DownloadCancelledMsg
source: The download was cancelled. If you have not cancelled the download yourself, please check your internet connection. The selected settings cannot be used without downloading the selected models.
de: Der Download wurde abgebrochen. Wenn Sie den Download nicht selbst abgebrochen haben, überprüfen Sie bitte Ihre Internetverbindung. Die ausgewählten Einstellungen können nicht verwendet werden, ohne die ausgewählten Modelle herunterzuladen.

# DownloadCancelledTitle
source: Download cancelled
de: Download abgebrochen

# InterpreterLanguage
source: Language
de: Sprache

# InterpreterMode
source: Mode
de: Modus

# InterpreterModeWrongErr
source: The interpreter mode can not be any type with llm, when llm model is disabled
de: Der Interpretermodus kann kein Typ mit LLM sein, wenn das LLM-Modell deaktiviert ist

# LlmContextSize
source: Context Size
de: Kontextgröße

# LlmCpuPrecisionNotSupportedErr
source: The precision fp16 is only available for gpu execution
de: Die Präzision FP16 ist nur für die Ausführung auf der GPU verfügbar.

# LlmGpuPrecisionNotSupportedErr
source: The precision int4 accelerated is only available for cpu execution
de: Die Präzision INT4-Beschleunigt ist nur für die Ausführung auf der CPU verfügbar.

# LlmMediumPrecisionNotSupportedErr
source: Only int4 accelerated precision is available for cpu execution for the model medium
de: Nur die Präzision INT4-Beschleunigt ist für die CPU-Ausführung des Modells Medium verfügbar.

# LlmMode
source: Mode
de: Modus

# LlmModel
source: Model
de: Modell

# LlmModelNotExistErr
source: The current selected large language model does not exist in the huggingface repository https://huggingface.co/microsoft. Please select another model configuration and try again.
de: Das aktuell ausgewählte große Sprachmodell existiert nicht im huggingface Repository https://huggingface.co/microsoft. Bitte wählen Sie eine andere Modellkonfiguration und versuchen Sie es erneut.

# LlmPrecision
source: Precision
de: Präzision

# SampleRateCanNotBeReadErr
source: The sample rate of the configuration file {0} can not be read properly. Make sure that the model is valid or try another one.
de: Die Abtastrate der Konfigurationsdatei {0} kann nicht gelesen werden. Stellen Sie sicher, dass das Modell gültig ist oder versuchen Sie ein anderes.

source: Speech Recognition Model
de: Sprache-zu-Text Modell

source: Text to Speech Model
de: Text-zu-Sprache Modell

# TtsLanguage
source: Language
de: Sprache

# TtsMode
source: Mode
de: Modus

# TtsModel
source: Model
de: Modell

# TtsModelNotExistErr
source: The current selected text-to-speech model does not exist in the huggingface repository https://huggingface.co/rhasspy/piper-voices. Please select another model configuration and try again.
de: Das aktuell ausgewählte Text-to-Speech Modell existiert nicht im huggingface Repository https://huggingface.co/rhasspy/piper-voices. Bitte wählen Sie eine andere Modellkonfiguration und versuchen Sie es erneut.

# TtsModelQuality
source: Model Quality
de: Modellqualität

# CreateAndDownloadBackupAction
source: Create & Download Website Backup
de: Serversicherung erstellen & herunterladen

# CreateAndDownloadBackupActionTooltip
source: Creates an complete backup of the website including the database and all files and downloads it
de: Erstellt ein vollständiges Backup der Serverkomponente einschließlich der Datenbank und aller Dateien und lädt es herunter
